--------------------------------------------------------------------------------
-- ファイルを取得するSQL
--------------------------------------------------------------------------------
SELECT_FILE_CONTROL =
SELECT
    FILE_OBJECT
FROM
    FILE_CONTROL
WHERE
    FILE_CONTROL_ID = ?
    AND SAKUJO_SGN='0'

--------------------------------------------------------------------------------
-- ファイルを登録するSQL
--------------------------------------------------------------------------------
INSERT_FILE_CONTROL =
INSERT INTO FILE_CONTROL(
   FILE_CONTROL_ID,
   FILE_OBJECT,
   SAKUJO_SGN
)
VALUES(
    ?,
    ?,
    '0'
)

--------------------------------------------------------------------------------
-- ファイルを論理削除するSQL
--------------------------------------------------------------------------------
DELETE_FILE_CONTROL = 
UPDATE FILE_CONTROL 
SET
    SAKUJO_SGN='1'
WHERE
    FILE_CONTROL_ID = ?
    AND SAKUJO_SGN='0'
